app/controllers/api/v1/likes_controller.rb

    def index
        likes = Like.all
---
SELECT "likes".* FROM "likes"

    def create
        @likes = Like.create(like_params)
---
INSERT INTO "likes" ("user_id", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["restaurant_id", 1], ["created_at", "2020-03-24 13:22:30.254528"], ["updated_at", "2020-03-24 13:22:30.254528"]]

    def destroy
        Like.destroy(params[:id])
---
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 10]]